In [9]:
import pandas as pd
my_dict = {'student1': [90, 84, np.nan], 'student2': [77, np.nan, np.nan], 'student3': [88, 65, 93]}
df = pd.DataFrame(my_dict)
display(df)

   student1  student2  student3
0      90.0      77.0        88
1      84.0       NaN        65
2       NaN       NaN        93

In [11]:
df.fillna(value=df.mean())

   student1  student2  student3
0      90.0      77.0        88
1      84.0      77.0        65
2      87.0      77.0        93

In [12]:
df = pd.DataFrame(np.arange(12).reshape(3, 4), columns=['A', 'B', 'C', 'D'])
display(df)

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [13]:
df.drop(df.columns[(df>=10).apply(lambda col: sum(col)>0)], axis=1)

   A  B
0  0  1
1  4  5
2  8  9